package com.javarush.cryptanalyzer.kavtasyev.constants;

import java.util.ArrayList;
import java.util.Collections;

public class FrequentWords
{
    public static final ArrayList<String> PREFIXES = new ArrayList<>();
    public static final ArrayList<String> ENDINGS = new ArrayList<>();
    public static final ArrayList<String> FREQUENT_WORDS = new ArrayList<>();

    static
    {
        Collections.addAll(PREFIXES, "(р|Р)ас", "(р|Р)аз", "(п|П)од", "(б|Б)ез", "(б|Б)ес", "(п|П)ро", "(о|О)т",
                "(д|Д)о", "(н|Н)а", "(н|Н)ад", "(з|З)а", "(п|П)ри", "(п|П)ре", "(п|П)ере", "(п|П)ред", "(п|П)ро", "(ч|Ч)ерез",
                "(ч|Ч)рез", "(ч|Ч)ерес", "(в|В)ос", "(в|В)оз", "(н|Н)аи", "(н|Н)едо", "(н|Н)из", "(н|Н)ис", "(о|О)бес",
                "(о|О)без", "(а|А)на", "(а|А)нти", "(а|А)рхи", "(г|Г)ипер", "(г|Г)ипо", "(д|Д)ез", "(д|Д)ис", "(и|И)н",
                "(к|К)ило", "(к|К)онтр", "(м|М)икро", "(м|М)акро", "(м|М)ега", "(о|О)рто", "(п|П)ара", "(п|П)ост",
                "(п|П)рото", "(с|С)уб", "(с|С)упер", "(т|Т)ранс", "(у|У)льтра", "(э|Э)кс");
        Collections.addAll(ENDINGS, "ий", "ый", "ая", "ое", "ого", "ой", "ому", "ую", "им", "ым", "ом", "а", "ы",
                "я", "и", "е", "ю", "у", "ей", "ем");
        Collections.addAll(FREQUENT_WORDS, "(н|Н)е", "(н|Н)и", "(н|Н)о", "(и|И)", "(в|В)", "(я|Я)", "(т|Т)ы",
                 "(о|О)н", "(о|О)на", "(о|О)ни","(о|О)но", "(м|М)ы", "(в|В)ы", "(т|Т)ебя", "(с|С)ебя", "(э|Э)то", "(т|Т)о",
                "(у|У)ж", "(в|В)сё", "(в|В)се", "(д|Д)а", "(н|Н)ет", "(к|К)ак", "(и|И)ли", "(ч|Ч)то", "(т|Т)ак", "(у|У)же",
                "(у|У)ж", "(л|Л)и", "(п|П)од", "(н|Н)ад", "(п|П)ро", "(п|П)осле", "(о|О)т", "(д|Д)аже", "(д|Д)альше",
                "(х|Х)отя", "(в|В)едь", "(п|П)очему", "(б|Б)ыстро", "(с|С)лева", "(с|С)права", "(р|Р)аз", "(т|Т)очно",
                "(е|Е)сть", "(и|И)менно", "(о|О)дин", "(д|Д)ва", "(т|Т)ри", "(ч|Ч)етыре", "(п|П)ять", "(ш|Ш)есть", "(с|С)емь",
                "(в|В)осемь", "(д|Д)евять");
    }
}
