package com.javarush.cryptanalyzer.kavtasyev.constants;

import java.util.ArrayList;
import java.util.Collections;

public class FrequentWords
{
    public static final ArrayList<String> PREFIXES = new ArrayList<>();
    public static final ArrayList<String> ENDINGS = new ArrayList<>();
    public static final ArrayList<String> FREQUENT_WORDS = new ArrayList<>();

    static
    {
        Collections.addAll(PREFIXES, "(р|Р)ас", "(р|Р)аз", "(п|П)од", "(б|Б)ез", "(б|Б)ес", "(п|П)ро", "(о|О)т",
                "(д|Д)о", "(н|Н)а", "(н|Н)ад", "(з|З)а", "(п|П)ри", "(п|П)ре", "(п|П)ере", "(п|П)ред", "(п|П)ро", "(ч|Ч)ерез",
                "(ч|Ч)рез", "(ч|Ч)ерес", "(в|В)ос", "(в|В)з", "(в|В)оз", "(н|Н)аи", "(н|Н)едо", "(н|Н)из", "(н|Н)ис",
                "(о|О)б", "(а|А)на", "(а|А)нти", "(а|А)рхи", "(г|Г)ипер", "(г|Г)ипо", "(д|Д)ез", "(д|Д)ис", "(и|И)н",
                "(к|К)ило", "(к|К)онтр", "(м|М)икро", "(м|М)акро", "(м|М)ега", "(о|О)рто", "(п|П)ара", "(п|П)ост",
                "(п|П)рото", "(с|С)уб", "(с|С)упер", "(т|Т)ранс", "(у|У)льтра", "(э|Э)кс");
        Collections.addAll(ENDINGS, "ий", "ый", "ая", "ое", "ого", "ой", "ому", "ую", "им", "ым", "ом", "а", "ы",
                "я", "и", "е", "ю", "у", "ей", "ем");
        Collections.addAll(FREQUENT_WORDS, "(а|А)", "(в|В)", "(и|И)", "(к|К)", "(о|О)", "(с|С)", "(я|Я)",

                "(б|Б)а", "(б|Б)е", "(б|Б)ы", "(в|В)о", "(в|В)ы", "(д|Д)а", "(д|Д)о", "(е|Е)(ё|Ё)", "(е|Е)й", "(е|Е)м",
                "(ж|Ж)е", "(з|З)а", "(и|И)з", "(к|К)о", "(л|Л)и", "(л|Л)ь", "(м|М)ы", "(н|Н)а", "(н|Н)е", "(н|Н)и",
                "(н|Н)о", "(н|Н)у", "(о|О)б", "(о|О)н", "(о|О)т", "(о|О)х", "(п|П)о", "(т|Т)а", "(т|Т)е", "(т|Т)о",
                "(т|Т)у", "(т|Т)ы", "(у|У)ж", "(х|Х)а",

                "(в|В)се", "(в|В)сё", "(в|В)от", "(д|Д)ва", "(е|Е)го", "(е|Е)му", "(е|Е)щ(ё|Ё)", "(и|И)ли", "(к|К)ак",
                "(к|К)ем", "(к|К)ом", "(м|М)ой", "(м|М)ои", "(н|Н)ад", "(н|Н)ет", "(о|О)на", "(о|О)ни","(о|О)но",
                "(п|П)од", "(п|П)ро", "(р|Р)аз", "(т|Т)ак", "(т|Т)от", "(т|Т)ри", "(у|У)же", "(ч|Ч)то", "(э|Э)то",

                "(б|Б)ыстро",
                "(в|В)едь", "(в|В)осемь",
                "(д|Д)аже", "(д|Д)альше", "(д|Д)евять",
                "(е|Е)сть", "(е|Е)сли",
                "(и|И)менно",
                "(о|О)дин",
                "(п|П)осле", "(п|П)очему", "(п|П)ять",
                "(с|С)ебя", "(с|С)емь", "(с|С)лева", "(с|С)права",
                "(т|Т)ебя", "(т|Т)очно",
                "(х|Х)отя",
                "(ч|Ч)етыре",
                "(ш|Ш)есть"
        );

    }
}
